CFDEM/CFDEMcoupling/tutorials/cfdemPimple/packedBed/CFD/system/outletAverage
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the average value of one or more fields on a patch.

\*---------------------------------------------------------------------------*/

type            surfaceFieldValue;
libs            ("libcatchyFieldFunctionObjects.so");

writeControl    timeStep;
writeInterval   1;

writeFields     false;
regionType      patch;

name            outlet;
fields          (T);

operation       weightedAreaAverage;
weightField     phi;

// ************************************************************************* //
