CFDEM/CFDEMcoupling/tutorials/cfdemPimple/packedBed/CFD/system/volAverage
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the average value of one or more fields on a patch.

\*---------------------------------------------------------------------------*/

type            volFieldValue;
libs            ("libcatchyFieldFunctionObjects.so");

writeControl    timeStep;
writeInterval   1;

writeFields     false;

fields          (T partTemp);

operation       weightedVolAverage;
weightField     partVolFraction;

// ************************************************************************* //
